{"pages":[{"title":"About","text":"Hi, DriftKingTW here. Welcome to my blog. I’m a junior web developer, and also a digital artist from Taiwan. Love to make stuff, especially electronic-related project. Not a native English speaker tho, but I’m trying to translate my post into English. If something looks odd, I apologize for that ｡ﾟ(ﾟ´ω`ﾟ)ﾟ｡ If you’re interested in my artwork, make sure to check out my Pixiv or DeviantArt. And the code I use in my project can be find on Github. BTW if you love EDM, go and check my friend’s music channel: Silaver. No doubt you’ll like it :D printf(“%s”, “Stay Curious, Stay Creative”)","link":"/en/about/index.html"}],"posts":[{"title":"Quick Fix - macOS WiFi Captive Portal Broken","text":"Q: Why I got error on captive portal wifi? A: Create a file my.shim.catalina.captivenetworkassistant.plist in ~/Library/LaunchAgents 12345678910111213141516171819202122&lt;?xml version=\"1.0\" encoding=\"UTF-8\"?&gt;&lt;!DOCTYPE plist PUBLIC \"-//Apple Computer//DTD PLIST 1.0//EN\" \\\"http://www.apple.com/DTDs/PropertyList-1.0.dtd\"&gt;&lt;plist version=\"1.0\"&gt; &lt;dict&gt; &lt;key&gt;Label&lt;/key&gt; &lt;string&gt;my.shim.catalina.captivenetworkassistant&lt;/string&gt; &lt;key&gt;LowPriorityIO&lt;/key&gt; &lt;true/&gt; &lt;key&gt;ProgramArguments&lt;/key&gt; &lt;array&gt; &lt;string&gt;open&lt;/string&gt; &lt;string&gt;/System/Library/CoreServices/Captive Network Assistant.app&lt;/string&gt; &lt;/array&gt; &lt;key&gt;WatchPaths&lt;/key&gt; &lt;array&gt; &lt;string&gt;/Library/Preferences/SystemConfiguration&lt;/string&gt; &lt;/array&gt; &lt;key&gt;RunAtLoad&lt;/key&gt; &lt;true/&gt; &lt;/dict&gt;&lt;/plist&gt; Then run the command down below: 1cd ~/Library/LaunchAgents 1launchctl load my.shim.catalina.captivenetworkassistant.plist 1launchctl start my.shim.catalina.captivenetworkassistant Restart the macOS, the issue should be solved 👌 If you want to remove this daemon: 1cd ~/Library/LaunchAgents 1launchctl stop my.shim.catalina.captivenetworkassistant 1launchctl unload my.shim.catalina.captivenetworkassistant.plist 1rm my.shim.catalina.captivenetworkassistant.plist The post I reference says that this issue fixed on 10.15.1 update, but I still got this error on 11.2.3 😭 Quick Fix is a series of my solution for some random problem ReferencemacOS Catalina WiFi issue — captive portal broken","link":"/en/QuickFix/macos-wifi-captive-portal-broken/"},{"title":"Quick Fix - Navbar Covers Heading While Using Anchor Link","text":"Q: This is a common CSS issue. When using &lt;a href=&quot;#heading&quot;&gt;&lt;/a&gt; to navigate around the article, the Fixed or Sticky will coverd the heading like this CodePen A: There’s hundred of ways to fix it, but this is probably the easiest way to do it (CSS only): 123:root &#123; scroll-padding-top: 3rem;&#125; You need to replace 3rem with the height of your nav, play with it in CodePen! Quick Fix is a series of my solution for some random problem Reference3 More Life-Changing CSS Tips 5 More Must Know CSS Tricks That Almost Nobody Knows MDN: scroll-padding-top","link":"/en/QuickFix/navbar-covers-heading-with-anchor-link/"},{"title":"Quick-Fix node-sass no such file or directory error","text":"Q: Recently I run into this error whe create a vue project via Vue-Cli : 12345 ERROR Failed to compile with 1 error error in ./src/App.vue?vue&amp;type=style&amp;index=0&amp;lang=scss&amp;Syntax Error: Error: ENOENT: no such file or directory, scandir '/***/node_modules/node-sass/vendor' A: Simply rebuild wil do the tirck：npm rebuild node-sass ReferenceError: ENOENT: no such file or directory, scandir ‘**/node_modules/node-sass/vendor’ #1579","link":"/en/QuickFix/node-sass-error/"},{"title":"Quick Fix - Can't import PSD on Affinity Photo iPad","text":"Q: I can’t import PSD file on Affinity Photo on my iPad? A: If you have Adobe Fresco installed, uninstall Fr and try it again. This probably is a bug in Affinity Photo, need to wait for developer to fix it. Quick Fix is a series of my solution for some random problem ReferenceCant import .psd file to Affinity designer/photo","link":"/en/QuickFix/cant-import-psd-on-affinity-photo-ipad/"},{"title":"A Better Server Status Monitoring Tool - Glances (htop/top Alternative)","text":"Recently, I’m looking for a temperture and cpu status monitor for my Pi nas server. vcgencmd command and htop get the jobs done, but it’s always better to have them in the same window (htop can’t show temperture which bothers me alot). So I found an cross-platform, python-based htop alternative - Glances, it’s easy to install and super handy. The only downside is that it uses a bit more cpu resources than I expected (on Pi4 4GB version). InstallationIn Linux (Debian, Ubuntu, etc.) you can simply use apt-get to install. sudo apt-get install glances If you have Homebrew installed on MacOS, use brew to install. brew install glances Note that I have run into some trouble when installing on MacOS, it shows the error message like this: 1234Traceback (most recent call last): File \"/usr/local/Cellar/glances/3.1.3/libexec/bin/glances\", line 6, in &lt;module&gt; from pkg_resources import load_entry_pointModuleNotFoundError: No module named 'pkg_resources' After googling, post-install should solved the problem. brew postinstall python3 Windows need to install python first, and use pip to get glances pip install glances UsageHost modeOpen Terminal and run glances glances Show RAW JSON status glances --stdout cpu.user,mem.used,load or in CSV format glances --stdout-csv now,cpu.user,mem.used,load Enter q or Esc to quit Server/Client ModeServer side: glances -s Client side (change SERVER-IP to your own server ip): glances -s SERVER-IP Remote mode (Web-UI)Server side: glances -w Client side (change SERVER-IP to your own server ip, default port 61208): http://SERVER-IP:61208 Done! Now you can monitoring all status (including cpu-temperture) in comfort! (Image shows my Pi nas’ status) ReferenceGlances fails after brew installation: ModuleNotFoundError: No module named ‘pkg_resources’ #260","link":"/en/2019/11/A-Better-Server-Status-Monitoring-Tool-Glances-htop-top-Alternative/"},{"title":"Use Raspberry Pi to build a FAKE TimeCapsule (and NAS) - Hardware","text":"There are plenty of Mac mini case modification projects on the internet. Though the unibody aluminum housing design had been there for almost a decade, it’s still the best looking mini computer case on the market imo. In mid 2019, Raspberry Pi receive a huge update - the Pi 4. We finally got true gigabit ethernet, USB3.0 support, and a lot more. This makes Pi 4 suitable for simple NAS project (also for TimeMachine backup). So I decide to build a fake(?) TimeCapsule with Pi (at least the case is real, or should I just call it “Fake Mac mini” ? lol) This article will show how I build this project, and the issue that I ran into (hardware side, the software configuration can be found at: Use Raspberry Pi to build a FAKE TimeCapsule - Software, Use Raspberry Pi as a NAS)(haven’t translate to English yet). Idea &amp;&amp; Design(https://static.driftking.tw/2024/06/e39d19076b26e35c8b8e075f87a977ed.jpg) I bought this used Mac mini case for cheap (around 20USD), it still in very good shape. You can buy it from ebay or AliExpress. First, let’s do some simple measure. The maximum motherboard you can put inside is around 17cm*17inch (lots of people use Mini-ITX in Mac mini’s case.) Height is about 2.5cm, for our Pi project is more than enough. Here’s the first design diagram (the hub will cause some issue so I connect the HDDs direct to Pi in final product, see Troubleshooting): All I need to do is mount these things up. So I decide to draw some 3D printed files to do the job. And here’s the diagram that shows each mounting hole’s distance I measured. Next, the HDD mount. The arm on both side aren’t strong enough, so I just cut them off. Here comes the tricky part. Unfortunately, there’s no information about the mounting screw for Mac mini case. ifixit only says it’s four 7.9mm long Torx screw, didn’t mention the shaft diameter. I tried several screw that I have, luckily, one screw can screw in and quite stable. So I can use caliper to measure it’s size: 1.7mm (You can use M1.7 phillips tapping screw instead of official torx screw) Pi mounting plate. An isolation brick to protect GPIO pins is nice to have: Make some feet under the mounting plate. The I/O shield (the plastic frame for Mini-ITX I/O shield is brought from other maker) Left side is for USB-C female connector and ethernet extender cable, right side for momentary power switch. I made some mistake about the side mounting holes on I/O shield, so just ignore it. (The ethernet extender cable’ screw can hold I/O shield in place) Also need to cut the Pi mounting plate to fit in the case. Finally, the 30mm fan mount: The STL files I used in this project can be download at: PiMacMiniCaseSTLFiles InstallationAlright, here’s the finished 3D printed items. (SLA Resin) I’ve found that the holes on I/O shield are a bit too small. So need to enlarge the Type-C and switch hole for a better fit. Sand down the surface and paint them in matte black. Ouch! There’s a crack on the edge when I try to trim it. But since it’s hide in the case, not a big deal. And I forgot the Micro SD on pi protrudes from the edge, so more trimming work need to be done. Then opens up the USB to SATA cable and cut out the VCC connect on board. Use some electrical tape to cover the board. Remember to check the pins with multimeter, make sure we didn’t ruined the cable. Screw in HDDs and test the mount. And solder the power line to Type-C connector. One for HDDs, other for Pi. Momentary switch with LED. I use 1k Ohm resistor here. About the wiring diagram you can check my other article: Raspberry Pi - Power switch, External power LED, SD Act LED(Haven’t translate to English yet) Test it! Glue the power switch and Type-C connector in place. Some simple wiring. Put on the bottom cover. Done! Bay ~ OK I think it just looks like a real Mac mini PS The max cpu temperature is around 50°C (room temp:26~28°C) TroubleshootingMac mini housing screw spec?I use phillips M1.7 x 6mm tapping screw. USB powered hub issueSome usb 3 powered hub will prevent Pi 4 from booting, here’s some discussion on Pi’s official forum: Pi 4 fails to boot when active USB switch attached. You can unplug the powered hub and plug it back. Pi will starts to boot and everything worked fine, but it’s really annoying. Some people reports that cut out the Vcc on hub can solve the issue, but I tried and nothing happened :( So I end up modify the USB to SATA cable instead. HDD and pi both using a 3A Official Power Supply？I actually connect 2 HDD and Pi to the same power source, which is an official power supply. The main reason I do this is to avoid Pi’s USB port maximum 1.2A downstream limit. I’ve measure the current drain on both HDD(w/ USB to SATA cable) and Pi, and it’s enough to be powered by a 3A power supply (my WD HDD’s peak current when activating is about 750mA) but can’t be power direct through Pi’s USB port due to 1.2A current limit. (I tried to connect direct to Pi’s USB, and one HDD fail to mount) Note that 1 HDD is fine to direct plug it into Pi’s USB port. Item list 1 x Pi 4 4GB 1 x 8G MicroSD Card for boot 1 x A1347 Apple Mac mini Case (Mid 2010) 2 x 2.5” HDD 2 x SATA to USB3 Cable 3D Printed Mount / IO Panel 1 x 30mm Fan 1 x Momentary Switch w/ LED &amp; Cap 1 x 3mm Front Panel LED 2 x Current-limiting Resistor (330Ω ~ 1kΩ) 1 x Gigabit Ethernet Network Extension Cable 1 x USB Type-C Male Connector w/ PCB 1 x USB Type-C Female Connector w/ PCB Some USB Cable (Current support 3A at least) 3 x M3 Screw &amp;&amp; M3 Hex Nut for Fan Mounting 4 x M3 Screw for HDD Mounting 2 x M3 Screw for Ethernet Port Mounting 3 x M1.7 Tapping Screw for Case Mounting w/ M2 Washer Some DuPont Line ReferenceMac Mini Mid 2010 Teardown Raspberry Pi GPIO Pinout Raspberry Pi 4 Tech Specs Power Supply Pi 4 fails to boot when active USB switch attached","link":"/en/2019/11/Use-RaspberryPi-to-build-a-FAKE-TimeCapsule-and-NAS-Hardware/"},{"title":"Using Raspberry Pi to Control a PWM Fan and Monitor its Speed","text":"A lot of people uses fan to cool down their Raspberry Pi 4, but the fan’s noise is quiet problem (in a quiet room). In most case pi didn’t need that amount of cooling performance, so we can use PWM (Pulse Width Modulation) to control fan speed and reduce the noise. WiringI use Noctua NF-A4 5V PWM, a 40mm, 5V PWM fan. Here’s the wiring diagram: Yellow: 5V Black: GND Green: RPM signal Blue: PWM signal input If your fan doesn’t support PWM control, then you can see #138 Variable Speed Cooling Fan for Raspberry Pi using PWM and PID controller or PWM Regulated Fan Based on CPU Temperature for Raspberry Pi to use a BJT transistor to use PWM control. The fan’s RPM signal is an OC(Open-Collector) circuit design (in most fan), so you’ll need a pull-up resistor to measure output waveform according to Noctua PWM white paper. Warning! The Pi has 3.3V GPIO, so your pull-up resistor must be connect to 3.3V ONLY! You will fry your Pi if Vcc is connected to 5V. The pull-up resistor that I use is 1kΩ 1/4W. The white paper says the maximum current is 5mA. According to Ohm’s Law: $V=IR$, the resistor should be 660Ω or larger to protect your fan. Most micro-controller or SBC already have a decent circuit to generate PWM signal, you don’t need special circuit to generate it. I use a Molex 2510 4PIN (2.54mm) connector to connect the fan. (Need to cut out some fool-proof board to fit.) Here’s a photo testing hardware and program on Pi 3B.` Control ScriptPWM GPIO TestI use Wiring Pi to test PWM signal. If you don’t want to test it, jump to Use PWM to Control Fan Speed. The Pi4 haven’t update to latest version of wiring-pi yet, need to update it manually. 123cd /tmpwget https://project-downloads.drogon.net/wiringpi-latest.debsudo dpkg -i wiringpi-latest.deb Version check： gpio -v The latest version when I write this post is 2.52 Read GPIO status： gpio readall Set pin 1 to PWM mode (using wiring-pi pin number: Pi GPIO Pinout). gpio mode 1 pwm Set PWM signal (number from 0~1023) gpio pwm 1 [number] Check the fan is working as you expect. Use PWM to Control Fan SpeedThe control script is on: DriftKingTW/Raspberry-Pi-PWM-Fan-Control I use GPIO18 which is the hardware PWM(12/13 and 18/19) and all other pins are software PWM. Hardware PWM and the headphone jack use the same circuits, don’t use them at the smae time. mkdir -p Scripts cd Scripts/ Download the python script: 1wget https://raw.githubusercontent.com/DriftKingTW/Raspberry-Pi-PWM-Fan-Control/master/fan_control.py python fan_control.py And make it auto start: Edit rc.local 1sudo vim /etc/rc.local Add the following line before exit 0 : 1python /home/pi/Scripts/fan_control.py &amp; The route might be different for you. Make sure you’re using absolute path. The ‘&amp;’ symbol means this script runs in background. If you don’t want to know the theory part, than go ahead to: Reading RPM Signal PWM uses square wave’s duty-cycle to reduce the average value of voltage, if the duty cycle is 50%, the fan will spin at 50% of it’s full speed; duty cycle 75%, fan 75%, and so on. More detail: Pulse-width modulation And we can take a look at the control script: 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465import RPi.GPIO as GPIOimport timeimport signalimport sysimport os# ConfigurationFAN_PIN = 18 # BCM pin used to drive PWM fanWAIT_TIME = 1 # [s] Time to wait between each refreshPWM_FREQ = 25 # [kHz] 25kHz for Noctua PWM control# Configurable temperature and fan speedMIN_TEMP = 40MAX_TEMP = 70FAN_LOW = 40FAN_HIGH = 100FAN_OFF = 0FAN_MAX = 100# Get CPU's temperaturedef getCpuTemperature(): res = os.popen('vcgencmd measure_temp').readline() temp =(res.replace(\"temp=\",\"\").replace(\"'C\\n\",\"\")) #print(\"temp is &#123;0&#125;\".format(temp)) # Uncomment for testing return temp# Set fan speeddef setFanSpeed(speed): fan.start(speed) return()# Handle fan speeddef handleFanSpeed(): temp = float(getCpuTemperature()) # Turn off the fan if temperature is below MIN_TEMP if temp &lt; MIN_TEMP: setFanSpeed(FAN_OFF) #print(\"Fan OFF\") # Uncomment for testing # Set fan speed to MAXIMUM if the temperature is above MAX_TEMP elif temp &gt; MAX_TEMP: setFanSpeed(FAN_MAX) #print(\"Fan MAX\") # Uncomment for testing # Caculate dynamic fan speed else: step = (FAN_HIGH - FAN_LOW)/(MAX_TEMP - MIN_TEMP) temp -= MIN_TEMP setFanSpeed(FAN_LOW + ( round(temp) * step )) #print(FAN_LOW + ( round(temp) * step )) # Uncomment for testing return ()try: # Setup GPIO pin GPIO.setwarnings(False) GPIO.setmode(GPIO.BCM) GPIO.setup(FAN_PIN, GPIO.OUT, initial=GPIO.LOW) fan = GPIO.PWM(FAN_PIN,PWM_FREQ) setFanSpeed(FAN_OFF) # Handle fan speed every WAIT_TIME sec while True: handleFanSpeed() time.sleep(WAIT_TIME)except KeyboardInterrupt: # trap a CTRL+C keyboard interrupt setFanSpeed(FAN_HIGH) #GPIO.cleanup() # resets all GPIO ports used by this function Reading RPM SignalGithub: DriftKingTW/Raspberry-Pi-PWM-Fan-Control 1wget https://raw.githubusercontent.com/DriftKingTW/Raspberry-Pi-PWM-Fan-Control/master/read_fan_speed.py Run script and you will get RPM value every second: python read_fan_speed.py 12345678910111213141516171819202122232425262728293031323334353637383940import RPi.GPIO as GPIOimport time# Pin configurationTACH = 24 # Fan's tachometer output pinPULSE = 2 # Noctua fans puts out two pluses per revolutionWAIT_TIME = 1 # [s] Time to wait between each refresh# Setup GPIOGPIO.setmode(GPIO.BCM)GPIO.setwarnings(False)GPIO.setup(TACH, GPIO.IN, pull_up_down=GPIO.PUD_UP) # Pull up to 3.3V# Setup variablest = time.time()rpm = 0# Caculate pulse frequency and RPMdef fell(n): global t global rpm dt = time.time() - t if dt &lt; 0.005: return # Reject spuriously short pulses freq = 1 / dt rpm = (freq / PULSE) * 60 t = time.time()# Add event to detectGPIO.add_event_detect(TACH, GPIO.FALLING, fell)try: while True: print \"%.f RPM\" % rpm rpm = 0 time.sleep(1) # Detect every secondexcept KeyboardInterrupt: # trap a CTRL+C keyboard interrupt GPIO.cleanup() # resets all GPIO ports used by this function ReferenceNoctua PWM specifications white paper NF A4x10 5V PWM Wiring Pi wiringPi updated to 2.52 for the Raspberry Pi 4B #138 Variable Speed Cooling Fan for Raspberry Pi using PWM and PID controller rxseger/tachfan.py raspberry-gpio-python","link":"/en/2019/11/Using-Raspberry-Pi-to-Control-a-PWM-Fan-and-Monitor-its-Speed/"},{"title":"Using DisplayCAL to Calibrate External Monitor on Apple Silicon Mac","text":"I’ve got myself an Apple Silicon Mac last year, although it’s really amazing but still have some compatibility issues. When I want to use DisplayCAL to recalibrate my external monitor, but the it didn’t recognize both of my external monitor. Here’s the workaround for this issue: Wrong ArgyllCMS VersionDisplayCAL will install ArgyllCMS when first launch, but it won’t recognize my external monitor: The reason why is DisplayCAL actually not install the latest version of ArgyllCMS (though it says it’s the latest) So we need to install the latest version of ArgyllCMS by ourselves and replace it (v2.3.0 when I writing this) Go to DisplayCAL and download the latest version of DisplayCAL Plug in your monitor calibrator (SpyderX in my case) It will prompt you to download the “latest version” of ArgyllCMS Cancel it and download Intel OS X 10.6 64 bit or later from ArgyllCMS Unzip the .tgz archive, and move Argyll_V2.3.0 folder to ~/Library/Application Support/DisplayCAL/dl (version might be different) Go back to DisplayCAL and choose File &gt; Locate ArgyllCMS executables... from menu bar. Set ArgyllCMS location to ~/Library/Application Support/DisplayCAL/dl/Argyll_V2.3.0/bin/ The external monitor should appear in list after restarting DisplayCAL, macOS might prompt you to prevent from unauthorized app to run,remember to force open all executables from Security and Privacy settings. I’ve ran into some glitches with this solution, it will turn the monitor black when the calibration is completed at first time, I need to re-plug the monitor cable to lit up again and allow macOS to run the last step to finish install ICC profile. It’s better to run a quick calibration at first to see if there’s any problem. Reference Mac Mini M1 color calibration DisplayCAL ArgyllCMS","link":"/en/2022/02/calibrate-external-monitor-on-apple-silicon-mac-by-displaycal/"},{"title":"Logitech Master 3 Gesture Button Modification","text":"Logitech’s Master/Anywhere series has been my favorite mice for years. But recently I don’t feel very comfortable when using my Master 3 with multiple devices, because the only button that switches device is located under the mouse. Since my 2 devices aren’t in the same network so Logitech Flow won’t work either. Not really sure why Logitech doesn’t allow user to configure gesture button to switch devices :( so I came up with an idea to solve it. ModificationThe idea is actually quite simple. I can connect the device switch button to thumb gesture button, and configure it to do nothing when pressed in Logitech Options. Here’s how I do it: Remove mouse feet and screws (1 x T5 and 5 #0 Philips Screws) Be careful with the ribbon when open the top case Unscrew all components (battery, scrolling wheel) (Optional) I also change the momentary switch by the way, Kailh silent mouse switches were used this time Wired up the switch device button with thumb gesture button Set gesture button to Do Nothing in Logitech Options Finish! It’s quite easy if you have experience with soldering. Now when I need to switch device I can just use the thumb gesture button instead of keep fliping the mouse :D And here’s some minor issue I want to mention about this mod: You’ll need to press gesture buttton once before start to switching the device. (probably because there’re some energy saving mechanism) If you have thinner wire the better, mine is a bit too thick so the original switch device button get stuck. Since I don’t use that button to switch device so it’s not really a issue for me, just be aware. Thanks for your reading 😊 ReferenceHow to Open the Logitech MX Master 3","link":"/en/2022/04/logitech-master-3-gesture-button-modify/"},{"title":"Make an iPad Drawing Board That Improves Your Drawing Experience","text":"iPad and Apple Pencil combo probably has the best drawing experience in the tablet market for now, tons of people love using their iPad to create amazing artworks, but you might encounter an common issue (especially for 11 inch user): The iPad’s bezel is way too small for your hand to rest on, even it’s laid down flat on the table. Though the iPad is already very thin (5.9mm on pro model), the drawing experience is still far from drawing on a flat thin paper, and putting hand on iPad just waste a large portion of the screen, which is the main reason I come up with this project today. The result was quite good, it’s very easy to make and costs under 35 dollar, so I want to share with you today. DraftingFirst, this project is design to create a flat surface for your hand to rest on when drawing on an iPad. Most drawing tablets on the market always have some sort of bezel for hands to rest on, but it’s imaginable that Apple will never design like this on a consumption/portable tablet. Since iPad is not only for drawing purpose, so I came up with this idea: I can make myself an iPad drawing board, that is detachable when you don’t need it (like when you go on a trip and just want to watch Netflix on it), which sounds great right? Of course I’m not the first one trying to solve this issue, there’s already similar products on the market: Sketch Board Pro but the $120’s price tag is just a bit too high, and the size is too large for my table. The other one I found on Taobao is pretty cheap like around 30~40USD, but it’s very thick, heavy and most importantly, the size is too large for my table too. So I decide to make one fits myself. The goals for this project: The hand can rest on the same level with iPad’s screen Design for iPad Pro 11 inch and iPad Air 4 Won’t block any feature on iPad (buttons, speaker, etc.) iPad can attach on it with magnet As portable as possible Can use both in portrait and landscape mode The cheaper the better After serious thought, here’s my solution: The material I plan to use is linden plywood, 4 layers in total. The reason that I make the USB C slot facing outside is because it can be used with any accessory, like a Type-C hub for example. The magnet part to hold iPad is actually pretty easy to deal with, I just use third-party magnet folio cover and cut it in half, then glued onto the plate and that’s it. You can use the Apple official folio cover to get the best result but I think that’s an over kill LOL. BTW for those who interest, the folio cover I use is from UGreen, I’ve seen ESR has the same kind of product too. All of them works I think. Then use Illustrator to draw the outline of the board. 5mm Bottom plate, about $31cm * 24.5cm$ and have a notch for Apple Pencil. 3mm Bottom plate, it will glue to the top of 5mm one, it has a camera hole to fit the camera bump. The hand rest has 2 layers too, one for 3mm the other is 5mm. 8mm total is about as same thickness as the iPad plus the folio cover. And there’s a cutout at the bottom right for power button or Air 4’s finger print reader. You can support me and download the *.ai files from here 😉 Material/Tool Laser cutting linden plywood Adhesive for wood (I use 3M Scotch, you can use white glue but needs more time to dry) Folio cover Black tape (fix the cover edge after cutting) File (smooth down the edge of woods) Make it realIt’s actually almost done after we got the laser cutting plywood. Cut the folio cover and glue them together, done! You can use it with any tablet/laptop stand you want! Landscape mode: Portrait mode: It’s just what we want right? And iPad is very stable thanks to the magnet cover underneath it, the speaker and buttons works just like normal, and the cutout for the Apple Pencil works as intended, it’s very easy to take it down and start drawing. Plus the size isn’t crazy big so we can take it to the coffee shop just like taking a 13 inch laptop. The best of all, it just cost less than 35 dollar! Improvement/TodoWell, there’s still some improvement that I think is great: VESA Mount Support (many drawing stand has VESA support) More easy way to dismount the iPad Add light-weight built-in stand Thanks for reading! (〃＾＾〃) Reference Accessory Design Guidelines for Apple Devices","link":"/en/2021/03/Make-an-iPad-Drawing-Board-That-Improve-Your Drawing-Experience/"}],"tags":[{"name":"Quick Fix","slug":"Quick-Fix","link":"/en/tags/Quick-Fix/"},{"name":"iPad","slug":"iPad","link":"/en/tags/iPad/"},{"name":"Affinity Photo","slug":"Affinity-Photo","link":"/en/tags/Affinity-Photo/"},{"name":"Fresco","slug":"Fresco","link":"/en/tags/Fresco/"},{"name":"vue","slug":"vue","link":"/en/tags/vue/"},{"name":"MacOS","slug":"MacOS","link":"/en/tags/MacOS/"},{"name":"WiFi","slug":"WiFi","link":"/en/tags/WiFi/"},{"name":"node-sass","slug":"node-sass","link":"/en/tags/node-sass/"},{"name":"CSS","slug":"CSS","link":"/en/tags/CSS/"},{"name":"DIY","slug":"DIY","link":"/en/tags/DIY/"},{"name":"illustration","slug":"illustration","link":"/en/tags/illustration/"},{"name":"RaspberryPi/樹莓派","slug":"RaspberryPi-樹莓派","link":"/en/tags/RaspberryPi-樹莓派/"},{"name":"NAS","slug":"NAS","link":"/en/tags/NAS/"},{"name":"TimeCapsule","slug":"TimeCapsule","link":"/en/tags/TimeCapsule/"},{"name":"TimeMachine","slug":"TimeMachine","link":"/en/tags/TimeMachine/"},{"name":"Apple Silicon","slug":"Apple-Silicon","link":"/en/tags/Apple-Silicon/"},{"name":"macOS","slug":"macOS","link":"/en/tags/macOS/"},{"name":"DisplayCAL","slug":"DisplayCAL","link":"/en/tags/DisplayCAL/"},{"name":"RaspberryPi","slug":"RaspberryPi","link":"/en/tags/RaspberryPi/"},{"name":"StatusMonitor","slug":"StatusMonitor","link":"/en/tags/StatusMonitor/"}],"categories":[]}